"""
Вывести на экран последовательно нечетные числа от 0 до 20 по одному на каждой строке.
"""

number = 1
while number < 20:
    print(number)
    number += 2


