"""
Вывести на экран последовательно числа от 1 до 20 по одному на каждой строке.
"""
number = 0
while number <= 20:
    print(number)
    number += 1
